app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "comments", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "witajcie railsy!"], ["comments", nil], ["created_at", Tue, 06 Dec 2011 17:31:53 UTC +00:00], ["title", "hello"], ["updated_at", Tue, 06 Dec 2011 17:31:53 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "comments" = '{hello, komentarz!, nowy!}', "updated_at" = '2011-12-06 17:53:35.969284' WHERE "posts"."id" = 1
---
  def comment
	  @post = Post.find(params[:id])
	  last = 0
	  if @post.comments
		  @post.comments = @post.comments | [params[:body]]
	  else
		  @post.comments = [params[:body]]
	  end

	  @post.save